### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [78]:
import pandas as pd

In [79]:
data = pd.read_csv('C:/Netology/PYDA_14/08_Pandas/ratings.csv')
data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [80]:
top_moveId = dict(data[ (data['rating'] == 5.0) ]['movieId'].value_counts())
for x in top_moveId:
    print(f"Фильм с индексом {x} набрал больше всего оценок 5.")
    break

Фильм с индексом 318 набрал больше всего оценок 5.

#### Что-то не очень разобрался как работать уже с результатами работы методов pandas. 
#### Дошел только до того, чтобы в словарь разложить...

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [84]:
data_power = pd.read_csv('C:/Netology/PYDA_14/08_Pandas/power.csv')
data_power.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [82]:
data_power.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [120]:
data_power = data_power[ (data_power['quantity'] >= 0.0) ] 
data_power = data_power[ (data_power['year'] >= 2005) & (data_power['year'] <= 2010) ]
data_power = data_power[ (data_power['category'] == 4) | (data_power['category'] == 12) | (data_power['category'] == 21) ]
data_power = data_power[ (data_power['country'] == 'Latvia') | (data_power['country'] == 'Lithuania') | (data_power['country'] == 'Estonia') ]

data_power['quantity'].sum()

240580.0

#### inplace применить не удалось, так как вроде как и методов то не было... Сплошная фильтрация по условиям.

### Задание 3
    Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
    Примеры страниц (необязательно брать именно эти):
    https://fortrader.org/quotes
    https://www.finanz.ru/valyuty/v-realnom-vremeni

In [135]:
tables = pd.read_html('https://infotables.ru/meditsina/1197-tablitsa-koronavirusa')[0]

In [136]:
tables.head()

,0,1,2,3,4,5
0,№,Страны мира c заболев­шими корона­вирусом,Забо­левшие (зара­женные),Умер­шие,Выздо­ровели,на 1000
1,NaN,ВСЕ СТРАНЫ (всего заболевших),42 419 042,1 147 020,28 628 824,552
2,1,США,8 529 944,224 385,3 375 427,2565
3,2,Индия,7 814 682,117 956,7 016 046,569
4,3,Бразилия,5 353 656,156 471,4 526 393,2530